[
    {
        "category": "AI Experimental Design & Pipeline",
        "description": "Structurally reduced model replacement/comparison costs through modularization of experimental pipelines.",
        "examples": [
            "Boostcamp Generation Project: Designed training/inference pipelines allowing experimentation with various LLMs under a unified interface.",
            "All Boostcamp Projects: Reduced repeat experiment setup time by automating environments with Bash scripts.",
            "Generation Project: Overcame single-disk constraints by implementing Distributed Sharding (Distributed Storage & Sharding strategies)."
        ]
    },
    {
        "category": "Data-Centric Model Improvement",
        "description": "Solved selection bias and generalization issues based on data imbalance analysis.",
        "examples": [
            "Generation Project: Mitigated answer number bias through item type oversampling and choice shuffling.",
            "MRC Project: Built Retriever training datasets based on Hard Negative Mining (Hard Negative Design).",
            "LG Aimers: Optimized feature configurations by separating IVF/DI treatment types (Domain-specific feature separation & redesign)."
        ]
    },
    {
        "category": "Model Selection & Performance Optimization",
        "description": "Rational model selection and ensemble strategies through multi-base model comparison under identical conditions.",
        "examples": [
            "Generation / Sentiment Analysis: Comparison of SLM/LLM and 5 Korean BERT-series models.",
            "Generation Project: Secured performance stability by designing Zero-shot CoT + Logits-based prediction ensemble strategies.",
            "Sentiment Analysis: Decided against Focal Loss after experimental analysis showed no performance gain (Data-driven decision making)."
        ]
    },
    {
        "category": "Collaboration & Project Leadership",
        "description": "Led project completion and established documentation systems through goal setting and schedule management.",
        "examples": [
            "Boostcamp AI Tech 8th: Led team-based projects as a core member.",
            "All Boostcamp Projects: Led documentation of design/experiments/results via GitHub, Notion, and Figma."
        ]
    },
    {
        "category": "Technical Scalability & Domain Adaptability",
        "description": "Experience in backend development and data analysis across various specialized domains.",
        "examples": [
            "SSALON: Designed backend APIs and implemented recommendation systems.",
            "WebGL Train Simulator: Designed 3D structures based on Scene Graph (Solving structural problems in non-AI domains).",
            "LG Aimers / Sentiment Analysis / Generation Project: Data analysis experience in Medical, Educational, and Content domains."
        ]
    }
]